import torch

a = torch.FloatTensor([[[1,2,3],[1,2,3],[1,2,3]],[[4,5,6],[4,5,6],[4,5,6]]])
print(a)
print(a.size())

print("=============== About B ===============")

b = a[:,-1,:]
print(b)
print(b.size())

# tensor([[[1., 2., 3.],
#          [1., 2., 3.],
#          [1., 2., 3.]],

#         [[4., 5., 6.],
#          [4., 5., 6.],
#          [4., 5., 6.]]])
# torch.Size([2, 3, 3])
# =============== About B ===============
# tensor([[1., 2., 3.],
#         [4., 5., 6.]])
# torch.Size([2, 3])


# 결과적으로 텐서 b에는 원래의 차원 (a,b,c) 에서 (a,c)차원 만이 저장되게된다. 즉 차원이 3차원 -> 2차원으로 변환됨.